app/Controllers/LoginController.php

SELECT *
FROM `member`
WHERE `email` = 'admin@mail.com'
 LIMIT 1
---
    public function login()
    {
        $json = $this->request->getJSON();

        $email    = $json->email ?? null;
        $password = $json->password ?? null;

        if (empty($email) || empty($password)) {
            return $this->responseHasil(400, false, 'Email dan password wajib diisi');
        }

        $model = new MMember();
        $member = $model->where(['email' => $email])->first();

SELECT *
FROM `member`
WHERE `member`.`id` = '1'
---
    public function getProfil($id = null)
    {
        $model = new MMember();
        $member = $model->find($id);