app/Controllers/NoteController.php

INSERT INTO `note` (`member_id`, `isi_note`, `time`) VALUES (1, 'beli pc gaming 8.8', '2026-08-08')
---
    public function create()
    {
        $json = $this->request->getJSON();

        $data = [
            'member_id' => $json->member_id ?? 1,
            'isi_note'  => $json->isi_note ?? null,
            'time'      => $json->time ?? null,
        ];

        if (empty($data['isi_note']) || empty($data['time'])) {
            return $this->responseHasil(400, false, 'Data note tidak boleh kosong');
        }

        $model = new MNote();
        $model->insert($data);

SELECT *
FROM `note`
WHERE `member_id` = '1'
ORDER BY `id` DESC
---
    public function list($member_id = null)
    {
        $model = new \App\Models\MNote();
        // Mencari seluruh catatan yang memiliki member_id sesuai dengan user yang login
        $notes = $model->where('member_id', $member_id)->orderBy('id', 'DESC')->findAll();