app/Controllers/ProdukController.php

    public function create()
    {
        $json = $this->request->getJSON();

        $data = [
            'kode_produk' => $json->kode_produk ?? null,
            'nama_produk' => $json->nama_produk ?? null,
            'harga'       => $json->harga ?? null,
        ];

        $model = new MProduk();
        $model->insert($data);
        $produk = $model->find($model->getInsertID());
---
INSERT INTO `produk` (`kode_produk`, `nama_produk`, `harga`) VALUES ('BRG-021', 'Monitor Asus', 2700000)
SELECT *
FROM `produk`
WHERE `produk`.`id` = 3

    public function list()
    {
        $model = new MProduk();
        $keyword = $this->request->getGet('keyword');
        $perPage = 10;

        if (!empty($keyword)) {
            $model->like('nama_produk', $keyword);
        }

        $produk = $model->paginate($perPage);
---
SELECT *
FROM `produk`
WHERE `nama_produk` LIKE '%as%' ESCAPE '!'
SELECT COUNT(*) AS `numrows`
FROM `produk`

    public function ubah($id)
    {
        $json = $this->request->getJSON();

        $data = [
            'kode_produk' => $json->kode_produk ?? null,
            'nama_produk' => $json->nama_produk ?? null,
            'harga'       => $json->harga ?? null,
        ];

        $model = new MProduk();
        $model->update($id, $data);
        $produk = $model->find($id);
---
SELECT *
FROM `produk`
WHERE `produk`.`id` = '4'

    public function hapus($id)
    {
        $model = new MProduk();
        $produk = $model->find($id);

        if (!$produk) {
            return $this->responseHasil(404, false, 'Data gagal dihapus, produk tidak ditemukan');
        }

        $model->delete($id);
---
DELETE FROM `produk`
WHERE `id` IN ('3')