app/Controllers/RegistrasiController.php

INSERT INTO `member` (`nama`, `email`, `password`) VALUES ('administrator10', 'admin@mail.com', '$2y$10$WDBrD5lBRE0kRJ3lL7liQebX0b8jEpup0VV/nRLHFLCG2oM844aWK')
---
    public function registrasi()
    {
        $json = $this->request->getJSON();

        if (empty($json->nama) || empty($json->email) || empty($json->password)) {
            return $this->responseHasil(400, false, 'Seluruh kolom pendaftaran wajib diisi');
        }

        $data = [
            'nama'     => $json->nama,
            'email'    => $json->email,
            'password' => password_hash($json->password, PASSWORD_DEFAULT),
        ];

        // Disamakan menggunakan MMember() atau MRegistrasi() tergantung penamaan berkas model akun Anda
        $model = new MMember();
        $model->save($data);